# IsolateElementTemporary Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..IsolateElementTemporary Method
View Class See Also
---
Set one element to be temporarily isolated in the view. To isolate a group completely, you must also include all members of all groups and nested groups in your input, therefore you should use the version of this method that accepts multiple element ids as input.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void IsolateElementTemporary(
	ElementId elementId
)
```

Visual Basic
---
```text
Public Sub IsolateElementTemporary ( _
	elementId As ElementId _
)
```

Visual C++
---
```text
public:
void IsolateElementTemporary(
	ElementId^ elementId
)
```

# ### Parameters
elementId
    Type: Autodesk.Revit.DB..::..ElementId Id of element to be isolated.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
View Class
Autodesk.Revit.DB Namespace